Revit 2027 API
RoomTag.TaggedRoomId Property
The LinkElementId of the tagged room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId TaggedRoomId { get; }
Public ReadOnly Property TaggedRoomId As LinkElementId
	Get
public:
property LinkElementId^ TaggedRoomId {
	LinkElementId^ get ();
}
member TaggedRoomId : LinkElementId with get
Property Value
LinkElementId
Remarks
If there is no tagged room in a linked document so the RoomTag is orphaned, LinkElementId will be InvalidElementId.
See Also
Reference
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace